{
  "subject_curriculum": [
    {
      "section_notes": null,
      "chapters_or_topics": [
        {
          "topic_notes": null,
          "topic_title": "ממדינת מקדש לעם הספר",
          "detailed_points": [
            "פרק ראשון: יהודה בתקופה הפרסית",
            "א. גלות בבל, הצהרת כורש ושיבת ציון",
            "1. היהודים בגלות בבל: מעמדם והשקפותיהם הדתיות.",
            "2. מדיניותו של כורש כלפי העמים באימפריה הפרסית",
            "3. הצהרת כורש: תוכנה ומהימנותה, הסיבות למתן ההצהרה והשפעתה",
            "4. גלי העלייה הראשונים: המניעים של העולים ומנהיגיהם",
            "ב. בניית בית המקדש",
            "1. בניית בית המקדש והגורמים שעיכבו את תהליך הבנייה.",
            "2. השומרונים: הסברים למוצאם, ראשית הסכסוך בינם ובין שבי ציון",
            "3. בית המקדש כמרכז החיים היהודיים: מרכז דתי, כלכלי וחברתי",
            "ג. עזרא ונחמיה",
            "1. עזרא הסופר: מעמדו, סמכויותיו ופעולותיו לגיבוש שבי ציון – קשיים והישגים.",
            "2. נחמיה: מעמדו, סמכויותיו ופעולותיו – קשיים והישגים",
            "3. המחלוקת בשאלת הזהות היהודית: הגישה הבדלנית מול הגישה האוניברסלית",
            "4. המבנה החברתי והמוסדות: הכהונה כמעמד מוביל, האצולה, 'הזקנים', אסֵפת העם, המועצה",
            "פרק שני: מאפייני ההלניזם",
            "א. הכרת גבולות האימפריה של אלכסנדר מוקדון ושל הממלכות שקמו לאחר מותו.",
            "ב. מאפייני החברה והמשטר: הפוליס ההלניסטית ומוסדותיה, המלך ומעמדו.",
            "ג. מאפייני התרבות ההלניסטית כתרבות אוניברסלית, שילוב תרבות המזרח והשפעות מתרבות יוון.",
            "פרק שלישי: המפגש בין החברה ביהודה ובין ההלניזם",
            "א. ארץ ישראל כזירת מאבק בין בית תלמי ובית סלווקוס",
            "1. חשיבותה של ארץ ישראל במהלך 'המלחמות הסוריות', והשפעת המאבק על ההנהגה החברתית-כלכלית ביהודה.",
            "2. כיבוש ירושלים בידי אנטיוכוס וכתב הזכויות ליהודים",
            "ב. השפעת ההלניזם על החברה ביהודה",
            "1. השפעות המפגש עם ההלניזם על צביונה של החברה היהודית בתחומים: תרבות, אורחות חיים, מפעלי בנייה ושינויים באופי ההנהגה (צמיחה של שכבת אצולה שלא ממעמד הכהונה ולא מצאצאי בית דוד)",
            "2. השפעות העולם ההלניסטי על יצירות ספרות שחוברו בידי יהודים: 'תרגום השבעים', 'חוכמת בן סירא'.",
            "ג. המאבק בין המתייוונים ובין המתנגדים ביהודה",
            "1. הכהונה הגדולה מובילה מהלך של העמקת ההתייוונות ביהודה: הקמת הפוליס 'אנטיוכיה' בירושלים.",
            "2. ה'חסידים' כמובילים את ההתנגדות לתהליך ההתייוונות",
            "ד. גזֵרות אנטיוכוס",
            "1. פירוט הגזרות.",
            "2. ההסברים השונים למתן הגזרות",
            "3. התגובות השונות של היהודים על הטלת הגזרות",
            "ה. מרד החשמונאים בימי מתתיהו ויהודה המקבי",
            "1. הסיבות למרד החשמונאים.",
            "2. הישגי יהודה המקבי במלחמותיו והסברים להצלחותיו",
            "3. הוויכוח בשאלת המשך הלחימה לאחר ביטול הגזרות והחזרת החירות הדתית",
            "פרק רביעי: ממדינה חשמונאית עצמאית לכיבוש רומי וחורבן בית המקדש",
            "א. ציוני דרך עיקריים בבניית המדינה החשמונאית וביסוסה.",
            "ב. הּכִתות הדתיות ועיקרי המחלוקת ביניהן: צדוקים, פרושים, איסיים.",
            "ג. דפוסי השלטון הרומאי בארץ ישראל ('מלך חסות' – הורדוס, הנציבים).",
            "ד. הסיבות למרד הגדול, העמדות השונות בוויכוח על יציאה למלחמה ברומאים.",
            "ה. תוצאות המרד וחורבן בית המקדש.",
            "ו. מצדה – השלב האחרון במרד נגד הרומאים.",
            "ז. הוויכוח ההיסטורי בנושא מלחמת מצדה בתקופות שונות.",
            "פרק חמישי: בין ייאוש לבנייה: מירושלים ליבנה",
            "א. רבן יוחנן בן זכאי והקמת המרכז ביבנה",
            "1. המשבר שנוצר בחברה היהודית עקב חורבן בית המקדש, והסכנות שנשקפו לחברה היהודית עקב משבר זה.",
            "2. בניית המרכז ביבנה: עיצוב חיים יהודיים ללא מקדש, יצירת גורמים מלכדים חדשים: תקנות חדשות 'זכר לחורבן', בית הכנסת, לימוד תורה ותפילה",
            "ב. מרד התפוצות – בימי הקיסר טרייאנוס",
            "1. הסיבות למרד היהודים בתפוצות והיקפו.",
            "ג. מרד בר כוכבא",
            "1. ההסברים השונים למרד בר כוכבא.",
            "2. היקף המרד, האירועים העיקריים בו, תוצאות המרד והשפעותיו",
            "3. דמותו של בר כוכבא כפי שעולה מהמקורות",
            "ד. הנשיאות בגליל",
            "1. מוסד הנשיאות וחשיבותו.",
            "2. מעמדו של רבי יהודה הנשיא ופעולותיו",
            "3. חשיבות חתימת המשנה כיסוד להלכה יהודית"
          ],
          "topic_time_allocation": null,
          "topic_specific_materials": null,
          "is_alternative_assessment_topic": true,
          "exam_exclusion_details_for_topic": null
        },
        {
          "topic_notes": null,
          "topic_title": "ערים וקהילות בימי הביניים",
          "detailed_points": [
            "א. יחידת המבוא: תמורות במאפייני העיר",
            "1. מורשת העולם היווני-רומי: העיר כמדינה, העיר כמרכז שלטון אימפריאליסטי (הבהרת המושגים).",
            "2. התפתחות העיר במעבר מהעת העתיקה לימי הביניים",
            "ב. העיר בעולם המוסלמי והקהילה היהודית בה",
            "העיר בעולם המוסלמי",
            "1. הגורמים שסייעו לייסוד ערים חדשות ולחיזוק ערים קיימות באימפריה המוסלמית.",
            "2. דפוסי הקמה של ערים חדשות והתפתחות ערים קיימות באימפריה המוסלמית",
            "3. מבנה העיר המוסלמית ומוסדותיה המרכזיים. תושבי העיר: מעמדם המשפטי ודפוסי המגורים שלהם",
            "4. השפעת השינויים הפוליטיים על מעמן של הערים בעולם המוסלמי",
            "הקהילה היהודית בעיר המוסלמית",
            "1. המעמד המשפטי של היהודים בערים המוסלמיות.",
            "2. העיסוקים הכלכליים של היהודים בערים המוסלמיות",
            "3. מאפייני הקהילה היהודית, ההנהגה העצמית ומוסדותיה בעולם המוסלמי",
            "ג. העיר באירופה הנוצרית והקהילה היהודית בה",
            "העיר באירופה הנוצרית",
            "1. הגורמים שסייעו לייסוד ערים ולחיזוק ערים קיימות באירופה הנוצרית בימי הביניים.",
            "2. דפוסי הקמה של ערים חדשות והתפתחות של ערים קיימות באירופה הנוצרית",
            "3. היחסים בין תושבי העיר ובין השלטון: המאבק של תושבי העיר להשגת חירויות, הדפוסים השונים של מתן חירויות על ידי השליטים במקומות השונים",
            "4. המבנה החברתי בעיר: ניידּות חברתית, משמעות המושג 'אזרח חופשי', מעמד הנשים בעיר",
            "5. המבנה הפיזי של העיר באירופה הנוצרית: מרחבים ציבוריים מול מרחבים פרטיים",
            "6. העיר כמרכז תרבותי-חינוכי (אוניברסיטאות) וכמרכז כלכלי (גילדות, שווקים, ירידים, בנקים",
            "הקהילה היהודית בעיר הנוצרית",
            "1. המעמד המשפטי של היהודים בערים הנוצריות.",
            "2. הדמיון והשוני בין הקהילה היהודית ובין קורפורציות אחרות שהתקיימו בערים",
            "3. מאפייני ההנהגה של הקהילה היהודית באירופה הנוצרית: מבנה ההנהגה, סמכויותיה, ואמצעי האכיפה שהיו בידה",
            "ד. ערים מדגימות: בגדד, פראג"
          ],
          "topic_time_allocation": null,
          "topic_specific_materials": null,
          "is_alternative_assessment_topic": true,
          "exam_exclusion_details_for_topic": null
        },
        {
          "topic_notes": null,
          "topic_title": "לאומיות בישראל ובעמים ראשית הדרך עד 1920",
          "detailed_points": [
            "א. מאפייני תופעת הלאומיות המודרנית והתנועות הלאומיות באירופה במאה ה-19",
            "ב. התנועה הלאומית היהודית המודרנית ומאפייניה העיקריים",
            "ג. דפוסי הפעילות של התנועה הציונית בגולה ובארץ ישראל",
            "ד. התנועה הציונית והיישוב היהודי בארץ ישראל בזמן מלחמת העולם הראשונה",
            "ה. השוואה בין התנועה הציונית בראשית דרכה ובין תנועות לאומיות של עמים אחרים באירופה במאה ה-19"
          ],
          "topic_time_allocation": null,
          "topic_specific_materials": null,
          "is_alternative_assessment_topic": false,
          "exam_exclusion_details_for_topic": null
        },
        {
          "topic_notes": null,
          "topic_title": "נאציזם, אנטישמיות מלחמת העולם והשואה",
          "detailed_points": [
            "מיעוטים באירופה בין שתי מלחמות עולם",
            "נאציזם, אנטישמיות, מלחמת העולם השנייה והשואה",
            "חלק ראשון 1933-1939",
            "חלק שני: ראשית מלחמת העולם השנייה עד מבצע ברברוסה (יוני 1941)",
            "חלק שלישי: המלחמה העולמית ו'הפתרון הסופי', מקיץ 1941 עד לכניעת גרמניה ויפן בשנת 1945"
          ],
          "topic_time_allocation": null,
          "topic_specific_materials": null,
          "is_alternative_assessment_topic": false,
          "exam_exclusion_details_for_topic": null
        },
        {
          "topic_notes": null,
          "topic_title": "בונים את מדינת ישראל במזרח התיכון",
          "detailed_points": [
            "פרק המבוא – בניין הבית הלאומי בשנים 1920-1945",
            "המאבק להקמת המדינה ומלחמת העצמאות, בשנים 1945-1949",
            "מדינת ישראל במזרח התיכון",
            "עלייה, קליטה ועיצוב החברה והתרבות במדינת ישראל"
          ],
          "topic_time_allocation": null,
          "topic_specific_materials": null,
          "is_alternative_assessment_topic": false,
          "exam_exclusion_details_for_topic": null
        }
      ],
      "main_section_title": "תוכנית הלימודים בהיסטוריה לכיתות י-י\"ב"
    }
  ]
}